#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results output :session *R:catboost* :width 640 :height 480 :colnames yes

* 全関数

#+begin_src R
pacman::p_funs(catboost)
#+end_src

#+RESULTS:
:  [1] "catboost.caret"                  "catboost.cv"                    
:  [3] "catboost.drop_unused_features"   "catboost.get_feature_importance"
:  [5] "catboost.get_model_params"       "catboost.get_object_importance" 
:  [7] "catboost.load_model"             "catboost.load_pool"             
:  [9] "catboost.predict"                "catboost.save_model"            
: [11] "catboost.save_pool"              "catboost.shrink"                
: [13] "catboost.staged_predict"         "catboost.sum_models"            
: [15] "catboost.train"

* Quick Start

- データ
#+begin_src R
features <- data.frame(
  feature1 = c(1, 2, 3),
  feature2 = c('A', 'B', 'C')
)
labels <- c(0, 0, 1)
train_pool <- catboost.load_pool(data = features, label = labels)
train_pool
#+end_src

#+RESULTS:
: catboost.Pool
: 3 rows, 2

- 学習
#+begin_src R
params <- list(
  loss_function = 'Logloss',
  iterations = 100,
  metric_period = 10
)

model <- catboost.train(
  learn_pool = train_pool,
  test_pool = NULL,
  params = params
)
#+end_src

#+RESULTS:
#+begin_example
Learning rate set to 0.007123
0:	learn: 0.6922866	total: 732us	remaining: 72.5ms
10:	learn: 0.6884971	total: 9.97ms	remaining: 80.7ms
20:	learn: 0.6848584	total: 22ms	remaining: 82.8ms
30:	learn: 0.6812990	total: 35.6ms	remaining: 79.2ms
40:	learn: 0.6757352	total: 38.7ms	remaining: 55.7ms
50:	learn: 0.6709307	total: 41.4ms	remaining: 39.8ms
60:	learn: 0.6671563	total: 43.5ms	remaining: 27.8ms
70:	learn: 0.6624763	total: 44.8ms	remaining: 18.3ms
80:	learn: 0.6577226	total: 47ms	remaining: 11ms
90:	learn: 0.6517507	total: 49ms	remaining: 4.85ms
99:	learn: 0.6450648	total: 50.5ms	remaining: 0us
#+end_example

- 予測
#+begin_src R
real_data <- data.frame(feature1 = c(2, 1, 3), feature2 = c('D', 'B', 'C'))
real_pool <- catboost.load_pool(real_data)

prediction <- catboost.predict(model, real_pool)
print(prediction)
#+end_src

#+RESULTS:
: [1] -0.13623098 -0.14058774  0.02136305

